package Algorithms;

// ДОПОЛНИТЕЛЬНО:
// DFS/BFS
// Префиксное дерево
// Суффиксное дерево
// Quad дерево
// Дерево отрезков
// Система непересекающихся множеств
// Алгоритмы Ли / Дейкстры / Флойда-Уоршелла
// Топологическая сортировка
// Алгоритм Кадане
// Алгоритм Кнута-Морриса-Пратта
// Динамическое программирование (DP)
// Quick Select
// Дерево Меркла
// Персистентные структуры данных
// Фильтр Блума
// Битовая карта
// B/B+ дерево
// LSM дерево
// Splay дерево
// Кольцевой буффер
// Фибоначчиева Куча
// Жадные алгоритмы

public class OtherAlgorithms {
}
